app/controllers/testrun_apps_controller.rb

SELECT  "testruns".* FROM "testruns" WHERE "testruns"."id" = ? LIMIT 1  [["id", 1]]
SELECT "apps".* FROM "apps" WHERE "apps"."testrun_id" = ?  [["testrun_id", 1]]
---
    def index
      @a = params[:AppNativeCode]
      @testrun = Testrun.find( params[:testrun_id])
      if params[:AppClass]
        @apps = @testrun.apps.where(:AppClass => params[:AppClass])

      elsif params[:AppNativeCode]

        @apps = @testrun.apps.where("AppNativeCode LIKE ? "    , "#{params[:AppNativeCode]}%")

SELECT  "apps".* FROM "apps" WHERE "apps"."testrun_id" = ? AND "apps"."id" = ? LIMIT 1  [["testrun_id", 1], ["id", 1]]
---
    def show
    	@app =@testrun.apps.find(params[:id])

SELECT  "apps".* FROM "apps" WHERE "apps"."testrun_id" = ? AND "apps"."id" = ? LIMIT 1  [["testrun_id", 1], ["id", 1]]
---
    def edit
    	@app = @testrun.apps.find(params[:id])

SELECT  "testruns".* FROM "testruns" WHERE "testruns"."id" = ? LIMIT 1  [["id", 1]]
---
  	def find_testrun
  		@testrun = Testrun.find( params[:testrun_id])